{
  "education": [
    {
      "awards_achievements": [
        "Top 15% (2017-2019): Faculty of Electrical Engineering \u0026 Computer Science, York University",
        "Chair's Honour Roll (2017-2018): Department of Mathematics \u0026 Statistics, York University",
        "GPA: 7.2/9.0"
      ],
      "degree": "Bachelor of Arts",
      "department": "Computer Science",
      "duration": "2017-2019",
      "school_name": "York University"
    },
    {
      "awards_achievements": [
        "Dean's List (2012-2015): George Brown College",
        "GPA: 3.6/4.0"
      ],
      "degree": "Advanced Diploma",
      "department": "Behavioral Science Technology",
      "duration": "2012-2015",
      "school_name": "George Brown College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AndresOsorio",
  "highlighted_projects": [
    {
      "description": "Designed and implemented 1) a Java-like programming language and 2) its two associated functionalities: Java-like code generation and type checking. The project was developed on the Eiffel Testing Framework (ETF) - Eiffel is an object-oriented and contract-based language. Implemented the project with the Visitor Design Pattern because it involves a language structure (classes, attributes, methods, etc.) that is meant to be closed for modification and language operations (code generation and type-checking) which are open for modification - this fulfills the open-close principle which is a requirement to apply the visitor pattern.",
      "git_url": "https://github.com/OneHoax/language_analyzer",
      "name": "Language Analyzer"
    },
    {
      "description": "Developed a fully responsive Single-Page-Webapp that works as a platform to deliver instructional content on physical training and nutrition; it uses vue.js + materialize for the front end and node.js + firebase for the back end (authorization and deployment). It supports registering and logging-in/out.",
      "git_url": "https://github.com/OneHoax/gym_platform",
      "name": "Gym Platform"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a monitoring agent to keep track of a cluster's resources and usage across time; this provided the team invaluable information about decisions to scale the cluster (and each node in it) up or down. The project was implemented with Bash, PostgreSQL, and Docker.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Grep App: Searches for a text pattern recursively in a given directory and outputs matched lines to a file - implemented with Java 8 Streams.",
        "JDBC App: Performs fundamental CRUD operations using the DAO pattern as an abstraction layer with DTOs as the actual objects encapsulating data to and from the data source.",
        "Twitter App: Posts/shows/deletes Twitter posts via the Twitter REST API - designed with the well-known MVC (minus V) architecture."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Developed a RESTful API using SpringBoot that simulates an online stock trading system; it retrieves stock market data from IEX Cloud and persists it into a PostgreSQL instance; this data can then be used to CRUD quote, trader, and order data against the database. This API can be consumed by front-end and mobile developers, as well as traders. The application is implemented as a microservice using SpringBoot (to manage dependencies and provide the web-server), PostgreSQL (to persist and CRUD data using DAO), and IEX Cloud (as the stock market data source); it also falls under the MVC and 3-tier architecture - it has a client tier (HTTP clients to consume API), an application tier (SpringBoot Java program which processes data), and a data tier (where data is persisted).",
      "git_url": "/springboot",
      "name": "SpringBoot App"
    },
    {
      "description": "Implemented a data analysis project to help a retail organization drive their revenue back up; specifically, the analysis segmented customers (using RFM Segmentation) into important categories to help the company develop targeted marketing strategies. Used a PostgreSQL instance as a data warehouse and Python Pandas/Jupyter to perform OLAP operations on the data and answer necessary business questions.",
      "git_url": "/python_data_wrangling",
      "name": "Data Wrangling"
    },
    {
      "description": "Evaluated Hadoop core components (HDFS, YARN, and MapReduce), deployed a 3-node Hadoop cluster using Google Cloud Platform Dataproc, and performed data processing/analytics using Hive and Zeppelin; leveraged the distributed storage and processing capabilities of the Hadoop ecosystem to examine the 2016 World Development Indicators dataset, optamize it, and ultimately do analytical operations on it.",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "In progress",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "Not Started",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Andres Osorio",
  "others": [
    {
      "bullets": [
        "Soccer Player"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked in a small scrum team building Data Engineering projects. Developed products successfully through continuous participation in scrum events and agile best practices. Implemented projects using Java, Maven, SpringBoot, Bash, RDBMS/SQL, Git, Hadoop, Spark/Scala, and Docker. Performed both integration and unit testing for each project using JUnit and Mockito. Used a Linux environment (centOS) for development.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "Community Living Toronto",
      "description": "Worked in the TRE ADD (Treatment, Research, and Education for Autism and Developmental Disabilities) program in a respite house. Provided patients support with their daily activities (Hygiene, feeding, and medication) and led behavioral programming to reduce problem behaviors and reinforce appropriate ones.",
      "duration": "2015-2017",
      "title": "Social Worker"
    },
    {
      "company": "Berlitz",
      "description": "Taught English to students of all ages and levels in 1:1 settings as well as in groups ranging from 2-20 students. Followed the company's dynamic and conversational teaching method and implemented it to my own approach.",
      "duration": "2009-2011",
      "title": "ESL Instructor"
    }
  ],
  "skills": {
    "competent": [
      "Big Data (Hadoop)",
      "Notebooks (Jupyter, Zeppelin)",
      "Python (NumPy, Pandas)",
      "REST APIs",
      "Eiffel",
      "C",
      "Go",
      "HTML/CSS/JavaScript",
      "Android Development"
    ],
    "familiar": [
      "Functional Programming",
      "Blockchain",
      "Operating Systems",
      "AI/ML",
      "CyberSecurity"
    ],
    "proficient": [
      "OOP",
      "Java",
      "SpringBoot",
      "Maven",
      "Linux/Bash",
      "Docker",
      "Git/GitHub",
      "RDBMS/SQL",
      "Agile/Scrum"
    ]
  },
  "summary": "Recent Computer Science graduate with a background in Behavior Analysis; I have experience in a wide variety of fields that have provided me with the right professional and personal skills needed to succeed in the software industry. The amount of data being created every year is growing at an exponential rate and will continue to do so; Data Engineering resonates with me because there is a need for qualified individuals to make sense of it all and I love both engineering and the patterns that arise from data. I am responsible, reliable, organized, disciplined, hard-working, fast-learning, and goal-oriented."
}
